## 데이터 입출력
- csv, excel, html, json, hdf5, sas, stata, sql....
- csv : 쉼표로 구분되어있는 텍스트 파일

In [2]:
import numpy as np
import pandas as pd

In [7]:
%%writefile sample.csv
no, score, name
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample.csv

In [8]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: BE6E-6940

 C:\k_digital\source\Data Science with Python 디렉터리

2022-10-26  오전 09:11    <DIR>          .
2022-10-26  오전 09:11    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 10:19    <DIR>          __pycache__
2022-10-25  오후 02:02             5,598 02. 기술 통계.ipynb
2022-10-25  오후 05:42            84,467 03. Pandas.ipynb
2022-10-26  오전 09:11             2,753 04 pandas  데이터분석.ipynb
2022-10-25  오후 12:29           153,360 1.Numpy.ipynb
2022-10-24  오후 12:18               152 my_array1.npy
2022-10-24  오후 12:21               554 my_array2.npz
2022-10-26  오전 09:11                61 sample.csv
2022-10-24  오전 10:19               176 teacher.py
               8개 파일             247,121 바이트
               4개 디렉터리  197,916,905,472 바이트 남음

In [9]:
# csv 파일 읽기
pd.read_csv('sample.csv')

   no   score    name
0   1    1.11     one
1   2    2.22     two
2   3    3.33   three

In [10]:
%%writefile sample1.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [14]:
pd.read_csv('sample1.csv', header = None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [15]:
pd.read_csv('sample1.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [16]:
pd.read_csv('sample.csv', index_col='no')

     score    name
no
1     1.11     one
2     2.22     two
3     3.33   three

In [17]:
%%writefile sample2.txt
c1       c2        c3       c4  
0.179187 -1.538472 1.347553 0.43381
1.179187 -2.538472 1.357553 0.43382
2.179187 -3.538472 1.367553 0.43383
3.179187 -4.538472 1.377553 0.43384
4.179187 -5.538472 1.387553 0.43385

Writing sample2.txt

In [18]:
pd.read_csv('sample2.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179187 -1.538472  1.347553  0.43381
1  1.179187 -2.538472  1.357553  0.43382
2  2.179187 -3.538472  1.367553  0.43383
3  3.179187 -4.538472  1.377553  0.43384
4  4.179187 -5.538472  1.387553  0.43385

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
         'year': [2000, 2001, 2002, 2001, 2002, 2003],
         'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
df.to_csv('sample3.csv', index=True, header = True)

In [21]:
!type sample3.csv

,state,year,pop
0,Ohio,2000,1.5
1,Ohio,2001,1.7
2,Ohio,2002,3.6
3,Nevada,2001,2.4
4,Nevada,2002,2.9
5,Nevada,2003,3.2

In [22]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: BE6E-6940

 C:\k_digital\source\Data Science with Python 디렉터리

2022-10-26  오전 09:27    <DIR>          .
2022-10-26  오전 09:27    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 10:19    <DIR>          __pycache__
2022-10-25  오후 02:02             5,598 02. 기술 통계.ipynb
2022-10-25  오후 05:42            84,467 03. Pandas.ipynb
2022-10-26  오전 09:27            16,214 04 pandas  데이터분석.ipynb
2022-10-25  오후 12:29           153,360 1.Numpy.ipynb
2022-10-24  오후 12:18               152 my_array1.npy
2022-10-24  오후 12:21               554 my_array2.npz
2022-10-26  오전 09:11                61 sample.csv
2022-10-26  오전 09:14                44 sample1.csv
2022-10-26  오전 09:21               219 sample2.txt
2022-10-26  오전 09:26               125 sample3.csv
2022-10-24  오전 10:19               176 teacher.py
              11개 파일             260,970 바이트
               4개 디렉터리  197,903,122,432 바이트 남음

## 데이터프레임 고급 인덱싱

In [23]:
# loc : 라벨값 기준으로 인덱싱, df.loc[행 인덱싱값] or df.loc[행 인덱싱값, 열 인덱싱값]
# iloc : 정수 기반의 인덱싱

In [24]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                 index = ['a','b','c'],
                 columns = ['one', 'two','three', 'four'])
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [25]:
# 인덱싱값 하나만 받아오는 경우
df.loc['b']

one      14
two      15
three    16
four     17
Name: b, dtype: int32

In [26]:
df.loc['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [27]:
df['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [28]:
df.loc[['b','c']]

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [29]:
df[['b','c']]

KeyError: "None of [Index(['b', 'c'], dtype='object')] are in the [columns]"

In [30]:
df['one']

a    10
b    14
c    18
Name: one, dtype: int32

In [31]:
df.one

a    10
b    14
c    18
Name: one, dtype: int32

In [32]:
df.one > 15

a    False
b    False
c     True
Name: one, dtype: bool

In [33]:
df[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [34]:
df.loc[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [35]:
def select_row(df):
    return df.one > 15

In [36]:
select_row(df)

a    False
b    False
c     True
Name: one, dtype: bool

In [37]:
df[select_row(df)]

   one  two  three  four
c   18   19     20    21

In [38]:
df.loc['one']

KeyError: 'one'

In [39]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4),
                  columns=list('ABCD'))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [40]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

#### 인덱싱값을 이용해서 행과 열 모두 추출하는 경우
- df.loc[행인덱스, 열인덱스]

In [41]:
df2.loc[0, 'A']

10

In [42]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [43]:
df.loc['b', 'two']

15

In [44]:
df.loc['b': , 'one']

b    14
c    18
Name: one, dtype: int32

In [45]:
df.loc['a', :]

one      10
two      11
three    12
four     13
Name: a, dtype: int32

In [46]:
df.loc[['a','b'], ['two','four']]

   two  four
a   11    13
b   15    17

In [47]:
df.loc[df.one > 10, ['three', 'four']]

   three  four
b     16    17
c     20    21

#### iloc 인덱싱

In [49]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [50]:
df.iloc[0, 1]

11

In [51]:
df.iloc[:2, 2]

a    12
b    16
Name: three, dtype: int32

In [52]:
df.iloc[0, -2:]

three    12
four     13
Name: a, dtype: int32

In [53]:
df.iloc[2:3, 1:3]

   two  three
c   19     20

In [54]:
df.iloc[-1]

one      18
two      19
three    20
four     21
Name: c, dtype: int32

In [55]:
df.iloc[-1] = df.iloc[-1] * 2
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   36   38     40    42

#### 모든 행과 열에 라벨을 가지고 있는 5행 5열 이상의 크기를 가지는 데이터프레임을 생성하시오.
#### 10가지 이상의 방법을 이용하여 특정 행 또는 열 또는 행과 열을 추출하는 작업을 수행하시오.

## 데이터 조작

#### 데이터 갯수 세기 : count

In [3]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s.count()

9

In [6]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

In [8]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [9]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [10]:
# 데이터 내용 미리보기 : head() or tail()
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [11]:
titanic.shape

(891, 15)

In [12]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
# 돗수분포 value_counts - 시리즈 타입
titanic['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [15]:
# 객실 등급별 승객수를 추출하시오.
titanic['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

#### 정렬
- sort_index()
- sort_values()

In [16]:
titanic['pclass'].value_counts().sort_index()

1    216
2    184
3    491
Name: pclass, dtype: int64

In [17]:
titanic['age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [18]:
titanic['age'].sort_values(ascending=False) # 내림차순

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [20]:
titanic.sort_values(by = 'age')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [21]:
titanic.sort_values(by = ['age', 'pclass'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [22]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [23]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [24]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [25]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [26]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [27]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [28]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [29]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [30]:
df[2].sort_values()

1    2.0
0    3.0
2    4.0
3    4.0
Name: 2, dtype: float64

In [31]:
df.sort_values(by=2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [32]:
df.sort_values(by=[1, 2], ascending=False)

     0    1    2    3
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0

#### titanic 데이터셋을 이용하여 승객의 성별 인원수, 나이별 인원수, 객실별인원수, 사망/생존 인원수 추출
- sort_values() 메서드를 이용할 것

### 행/열 합계
- sum(axis), axis = 0 행, axis = 1 열

In [33]:
df2 = pd.DataFrame(np.random.randint(10, size = (4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  7  8  4  4  7  7  4
1  9  0  2  0  7  1  7  9
2  8  4  0  1  9  8  2  3
3  1  2  7  2  6  0  9  2

In [34]:
# 행방향의 합계
df2.sum(axis=1)

0    46
1    35
2    35
3    29
dtype: int64

In [35]:
df2['rowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  rowSum
0  5  7  8  4  4  7  7  4      46
1  9  0  2  0  7  1  7  9      35
2  8  4  0  1  9  8  2  3      35
3  1  2  7  2  6  0  9  2      29

In [36]:
df2.sum() # axis = 0 생략

0          23
1          13
2          17
3           7
4          26
5          16
6          25
7          18
rowSum    145
dtype: int64

In [37]:
df2.loc['Total', :] = df2.sum()
df2

          0     1     2    3     4     5     6     7  rowSum
0       5.0   7.0   8.0  4.0   4.0   7.0   7.0   4.0    46.0
1       9.0   0.0   2.0  0.0   7.0   1.0   7.0   9.0    35.0
2       8.0   4.0   0.0  1.0   9.0   8.0   2.0   3.0    35.0
3       1.0   2.0   7.0  2.0   6.0   0.0   9.0   2.0    29.0
Total  23.0  13.0  17.0  7.0  26.0  16.0  25.0  18.0   145.0

### 연습문제
1. 타이타닉호에 승객들의 평균 나이를 추출하시오.
2. 타이타닉호에 승객중 여성 승객의 평균 나이를 추출하시오.
3. 타이타닉호에 승객중 1등실에 탑승한 여성 승객의 평균 나이를 추출하시오.

In [38]:
titanic['age'].mean()

29.69911764705882

In [41]:
titanic.loc[titanic['sex'] == 'female' , 'age'].mean()

27.915708812260537

In [43]:
titanic.loc[(titanic['sex'] == 'female') & (titanic['pclass'] ==1), 'age'].mean()

34.61176470588235

#### apply 함수
- 행이나 열에 반복적으로 처리하는 함수를 적용하는 함수
- 람다(lambda) 함수 : 익명의 함수
- 형식 => lambda 입력 : 출력

In [44]:
# 두 수를 입력받아 합을 계산하는 함수
def hap(x, y):
    return x + y

In [45]:
hap(10, 20)

30

In [49]:
# 람다 형식으로 표현하려면
(lambda  x, y : x + y)(10, 20)

30

In [50]:
10 + 20

30

#### map(함수, 리스트)

In [51]:
list(map((lambda x : x ** 2), range(5)))

[0, 1, 4, 9, 16]

In [52]:
df3 = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [53]:
# 각 열에 최대값과 최소값의 차이를 구하시오
df3.apply(lambda x : x.max() - x.min()) # axis=0

A    3
B    2
C    4
dtype: int64

In [54]:
# 각 행에 최대값과 최소값의 차이를 구하시오.
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [56]:
# 각 열에 값들에 건수를 추출하시오.
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [58]:
# 타이타닉호의 승객중 나이가 20살을 기준으로 성인(Adult)과 미성년자(Child)를 구별하여 파생변수
# adult/child에 담는 작업을 수행하시오.
titanic['adult/child'] = titanic.apply(lambda df : 'adult' if df.age >= 20 else 'child', axis = 1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

In [ ]:
def adult_child(df):
    if df.age >= 20:
        'adult'
    else:
        'child'

In [ ]:
titanic.apply(adult_child , axis=1)

In [59]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

#### fillna()
- NaN 값을 원하는 값으로 대체하는 함수

In [61]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [62]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [63]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 타이타닉호의 승객의 나이중 NaN으로 나이가 명시되지 않은 고객의 나이를 평균 나이값으로 대체하는 작업을 수행하시오.

In [64]:
titanic['age'].fillna(29)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

#### astype() : 자료형을 바꾸는 함수

In [65]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

#### 데이터프레임의 인덱스 설정 및 제거
- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [66]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5) ,2)]).T,
                  columns=['C1','C2','C3','C4'])
df1

  C1    C2    C3    C4
0  A  0.38  0.15  0.76
1  B  0.76  0.58  0.47
2  C  0.77  0.01  0.27
3  D   0.3  0.71  0.83
4  E  0.77  0.47  0.55

In [67]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.38  0.15  0.76
B   0.76  0.58  0.47
C   0.77  0.01  0.27
D    0.3  0.71  0.83
E   0.77  0.47  0.55

In [68]:
df2.set_index('C2')

        C3    C4
C2
0.38  0.15  0.76
0.76  0.58  0.47
0.77  0.01  0.27
0.3   0.71  0.83
0.77  0.47  0.55

In [69]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.38  0.15  0.76
1  B  0.76  0.58  0.47
2  C  0.77  0.01  0.27
3  D   0.3  0.71  0.83
4  E  0.77  0.47  0.55

In [70]:
df2.reset_index(drop=True)

     C2    C3    C4
0  0.38  0.15  0.76
1  0.76  0.58  0.47
2  0.77  0.01  0.27
3   0.3  0.71  0.83
4  0.77  0.47  0.55

#### 다중 인덱스

In [71]:
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns = [['A','A','B','B'],
                             ['C1','C2','C1','C2']])
df3

      A           B
     C1    C2    C1    C2
0 -0.05 -0.77 -0.77  0.61
1 -1.55 -0.20 -1.47  0.04
2  0.03 -0.64 -0.37 -1.17
3  0.02 -0.98 -0.30 -0.57
4 -0.93 -0.77  0.15 -0.85

In [74]:
df3.columns.names = ['Cidx1', 'Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0     -0.05 -0.77 -0.77  0.61
1     -1.55 -0.20 -1.47  0.04
2      0.03 -0.64 -0.37 -1.17
3      0.02 -0.98 -0.30 -0.57
4     -0.93 -0.77  0.15 -0.85

In [73]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [77]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4), 2),
                  columns = [['A','A','B','B'],['C','D','C','D']],
                  index = [['M','M','M','F','F','F'],
                           ['id_' + str(i + 1) for i in range(3)]*2])
df4

           A           B
           C     D     C     D
M id_1  0.27  0.41 -0.34  0.11
  id_2  0.57  0.69  1.72 -2.42
  id_3 -1.50  0.05 -0.08  0.84
F id_1  0.37 -0.51 -0.74 -0.26
  id_2  1.17  0.26 -1.51  1.06
  id_3  0.18  1.76 -0.73  0.51

In [75]:
['id_' + str(i + 1) for i in range(3)] * 2

['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']

In [76]:
np.round(np.random.randn(6,4), 2)

array([[-1.84, -1.14, -0.59,  0.88],
       [ 0.78,  1.5 ,  1.54, -0.45],
       [-1.78, -1.79, -1.01, -0.4 ],
       [ 0.54,  1.3 ,  0.09, -0.28],
       [-0.4 , -0.71, -1.36, -0.84],
       [-0.49, -0.14, -0.87,  1.05]])

In [78]:
df4.columns.names = ['Cidx1', 'Cidx2']
df4.index.names = ['Ridx1', 'Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.27  0.41 -0.34  0.11
      id_2   0.57  0.69  1.72 -2.42
      id_3  -1.50  0.05 -0.08  0.84
F     id_1   0.37 -0.51 -0.74 -0.26
      id_2   1.17  0.26 -1.51  1.06
      id_3   0.18  1.76 -0.73  0.51

In [79]:
# 행인덱스와 열인덱스 교환
## stack() : 열인덱스 => 행인덱스
## unstack() : 행인덱스 => 열인덱스
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      0.27  0.41
            B     -0.34  0.11
      id_2  A      0.57  0.69
            B      1.72 -2.42
      id_3  A     -1.50  0.05
            B     -0.08  0.84
F     id_1  A      0.37 -0.51
            B     -0.74 -0.26
      id_2  A      1.17  0.26
            B     -1.51  1.06
      id_3  A      0.18  1.76
            B     -0.73  0.51

In [80]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      0.27 -0.34
            D      0.41  0.11
      id_2  C      0.57  1.72
            D      0.69 -2.42
      id_3  C     -1.50 -0.08
            D      0.05  0.84
F     id_1  C      0.37 -0.74
            D     -0.51 -0.26
      id_2  C      1.17 -1.51
            D      0.26  1.06
      id_3  C      0.18 -0.73
            D      1.76  0.51

In [81]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0     -0.05 -0.77 -0.77  0.61
1     -1.55 -0.20 -1.47  0.04
2      0.03 -0.64 -0.37 -1.17
3      0.02 -0.98 -0.30 -0.57
4     -0.93 -0.77  0.15 -0.85

In [83]:
# 다중 인덱스를 가지고 있는 경우에 인덱스 값이 하나의 라벨이나 숫자가 아니라 듀플로 둘러싸여야 한다.
df3[('B', 'C1')]

0   -0.77
1   -1.47
2   -0.37
3   -0.30
4    0.15
Name: (B, C1), dtype: float64

In [84]:
df3.loc[0, ('B', 'C1')]

-0.77

In [85]:
df3.loc[0, ('B', 'C1')] = 100
df3

Cidx1     A             B
Cidx2    C1    C2      C1    C2
0     -0.05 -0.77  100.00  0.61
1     -1.55 -0.20   -1.47  0.04
2      0.03 -0.64   -0.37 -1.17
3      0.02 -0.98   -0.30 -0.57
4     -0.93 -0.77    0.15 -0.85

In [86]:
# iloc 인덱서를 사용할 경우에는 튜플 형태의 다중인덱스를 사용할 수 없다.
df3.iloc[0, 2]

100.0

In [87]:
df3['A']

Cidx2    C1    C2
0     -0.05 -0.77
1     -1.55 -0.20
2      0.03 -0.64
3      0.02 -0.98
4     -0.93 -0.77

In [88]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.27  0.41 -0.34  0.11
      id_2   0.57  0.69  1.72 -2.42
      id_3  -1.50  0.05 -0.08  0.84
F     id_1   0.37 -0.51 -0.74 -0.26
      id_2   1.17  0.26 -1.51  1.06
      id_3   0.18  1.76 -0.73  0.51

In [89]:
df4.loc[('M', 'id_1'), ('A', 'C')]

0.27

### 데이터 프레임 합성 : merge, concatenate

In [98]:
df1 = pd.DataFrame({
    '고객번호':[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '고객이름':['고둘리','도우너','그냥또치','고길동', '고희동','마이콜','고영희']},
    columns = ['고객번호', '고객이름'])
df1

   고객번호  고객이름
0  1001   고둘리
1  1002   도우너
2  1003  그냥또치
3  1004   고길동
4  1005   고희동
5  1006   마이콜
6  1007   고영희

In [99]:
df2 = pd.DataFrame({
    '고객번호':[1001, 1001, 1005, 1006, 1007, 1001],
    '예금금액':[10000, 20000, 15000, 5000, 100000, 30000]
}, columns = ['고객번호', '예금금액'])
df2

   고객번호    예금금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1007  100000
5  1001   30000

In [100]:
# inner join
pd.merge(df1, df2)

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1001  고둘리   30000
3  1005  고희동   15000
4  1006  마이콜    5000
5  1007  고영희  100000

In [101]:
# outer join
pd.merge(df1, df2, how = 'outer')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜    5000.0
8  1007   고영희  100000.0

In [102]:
pd.merge(df1, df2, how = 'left')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜    5000.0
8  1007   고영희  100000.0

In [103]:
pd.merge(df1, df2, how = 'right')

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1005  고희동   15000
3  1006  마이콜    5000
4  1007  고영희  100000
5  1001  고둘리   30000

In [108]:
df1

   고객번호  고객이름
0  1001   고둘리
1  1002   도우너
2  1003  그냥또치
3  1004   고길동
4  1005   고희동
5  1006   마이콜
6  1007   고영희

In [109]:
df2

   고객번호    예금금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1007  100000
5  1001   30000

In [110]:
# join 메서드 : 행인덱스를 기준으로 결합한다.
df1.set_index('고객번호', inplace=True)

In [111]:
df1

      고객이름
고객번호
1001   고둘리
1002   도우너
1003  그냥또치
1004   고길동
1005   고희동
1006   마이콜
1007   고영희

In [112]:
df2.set_index('고객번호', inplace=True)

In [113]:
df2

        예금금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1007  100000
1001   30000

In [114]:
# join 메서드 : 행인덱스를 기준으로 결합한다.
df1.join(df2, how = 'outer')

      고객이름      예금금액
고객번호
1001   고둘리   10000.0
1001   고둘리   20000.0
1001   고둘리   30000.0
1002   도우너       NaN
1003  그냥또치       NaN
1004   고길동       NaN
1005   고희동   15000.0
1006   마이콜    5000.0
1007   고영희  100000.0

### concat 함수
- 기준열을 사용하지 않고 단순히 데이터를 연결하는 방식

In [115]:
s1 = pd.Series([0,1], index = ['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A','B','C'])

In [116]:
s1

A    0
B    1
dtype: int64

In [117]:
s2

A    2
B    3
C    4
dtype: int64

In [118]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [119]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                  index = list('abc'),
                   columns = ['데이터1','데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [120]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2, 2),
                  index = list('ac'),
                   columns = ['데이터3','데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [121]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [122]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [123]:
# pivot(행인덱스로 사용할 열이름, 열인덱스로 사용할 열이름, 데이터로 사용할 열이름)
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### 그룹분석 : groupby()
- size, count : 그룹 데이터의 갯수
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last
- agg, aggreate
- describe
- apply
- transform

In [124]:
df2 = pd.DataFrame({
    'key1':list('AABBA'),
    'key2':['one', 'two','one','two','one'],
    'data1':[1, 2, 3, 4, 5],
    'data2':[10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [125]:
# 그룹설정
groups = df2.groupby(df2.key1)
groups

In [127]:
groups.groups  # 그룹화한 것들의 인덱스가 저장되어 있다.

{'A': [0, 1, 4], 'B': [2, 3]}

In [128]:
# A그룹과 B그룹의 데이터들의 합계를 구하시오.
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [130]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [129]:
df2.data1

0    1
1    2
2    3
3    4
4    5
Name: data1, dtype: int64

In [131]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [133]:
df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [135]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64